Тест1/src/Documents/ПриходДенегНаСчет/ПриходДенегНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенегНаСчет</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЗаказНаДоставку</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.БаланПоНакладной</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаДоставку</types>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>EnumRef.ВидыПоступлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>DocumentRef.ЗаказНаДоставку</types>
        <types>DocumentRef.ЗаказНаряд</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/ПриходОтКредитов/ПриходОтКредитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходОтКредитов</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитВБанке</name>
    <type>
      <types>CatalogRef.ВложенияВолжска</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусКредита</types>
    </type>
  </attributes>
</mdclass:Document>

Тест1/src/Catalogs/Машины/Машины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Машины</name>
  <basedOn>Document.ФиксацияЗаказаМашин</basedOn>
  <attributes>
    <name>ВинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>EnumRef.Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.ТипТС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>CatalogRef.МодельТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказаниеОдометраНаНачалоЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <type>
      <types>EnumRef.ТипМашинНаРазборке</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>EnumRef.ТипыКабин</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателя</name>
    <type>
      <types>CatalogRef.МоделиДвигателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливнаяСистема</name>
    <type>
      <types>EnumRef.ТопливнаяСистема</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>CatalogRef.КПП</types>
    </type>
  </attributes>
  <attributes>
    <name>Редуктор</name>
    <type>
      <types>CatalogRef.Редукторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Серии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументФиксацииЗаказаМашины</name>
    <type>
      <types>DocumentRef.ФиксацияЗаказаМашин</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинаАгрегат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/Catalogs/ВложенияВолжска/ВложенияВолжска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВложенияВолжска</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/CommonModules/ЦУП/Module.bsl
Процедура ВыгрузитьНаСервер() Экспорт
	ИмяФайла = "D:\DropBox_DT\Dropbox\PublicDT\cup.json";
	вывод = новый Структура();
	з = новый запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ПродажаЗапчастей.Дата,
	          |	ПродажаЗапчастей.Номер,
	          |	ПродажаЗапчастей.Комментарий,
	          |	ПродажаЗапчастей.ИтогоРекв,
	          |	ПродажаЗапчастей.КтоПродал,
	          |	ПродажаЗапчастей.Оплачено,
	          |	ПродажаЗапчастей.Проведен,
	          |	ПродажаЗапчастей.Ссылка,
	          |	ПродажаЗапчастей.УжеОплачено
	          |ИЗ
	          |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей";
	продажи = з.Выполнить().Выгрузить();
	вывод.Вставить("продажи",продажи);
	
	з.Текст = "ВЫБРАТЬ
	          |	Счета.Ссылка,
	          |	Счета.Код,
	          |	Счета.Наименование,
	          |	Счета.Комментарий
	          |ИЗ
	          |	Справочник.Счета КАК Счета";
    счета = з.Выполнить().Выгрузить();
	вывод.Вставить("счета",счета);
	
	з.Текст = "ВЫБРАТЬ
	          |	Расходы.Дата,
	          |	Расходы.Номер,
	          |	Расходы.Проведен,
	          |	Расходы.ВидРасхода,
	          |	Расходы.Сумма,
	          |	Расходы.СчетОткудаРасход,
	          |	Расходы.Комментарий,
	          |	Расходы.Ссылка
	          |ИЗ
	          |	Документ.Расходы КАК Расходы";
	расходы = з.Выполнить().Выгрузить();
	вывод.Вставить("расходы",расходы);
	
	з.Текст = "ВЫБРАТЬ
	          |	ВидыРасходов.Ссылка,
	          |	ВидыРасходов.Код,
	          |	ВидыРасходов.Наименование
	          |ИЗ
	          |	Справочник.ВидыРасходов КАК ВидыРасходов";
	видрасхода = з.Выполнить().Выгрузить();
	вывод.Вставить("видрасхода",видрасхода);

	з.Текст = "ВЫБРАТЬ
	          |	Машины.Ссылка,
	          |	Машины.Код,
	          |	Машины.Наименование,
	          |	Машины.ВинКод,
	          |	Машины.Комментарий,
	          |	Машины.Сумма
	          |ИЗ
	          |	Справочник.Машины КАК Машины";
	машины = з.Выполнить().Выгрузить();
	вывод.Вставить("машины",машины);
	
	з.Текст = "ВЫБРАТЬ
	          |	ПриходДенегНаСчет.Ссылка,
	          |	ПриходДенегНаСчет.Номер,
	          |	ПриходДенегНаСчет.Дата,
	          |	ПриходДенегНаСчет.Проведен,
	          |	ПриходДенегНаСчет.Комментарий,
	          |	ПриходДенегНаСчет.ОбщаяСумма,
	          |	ПриходДенегНаСчет.ТабличнаяЧасть1.(
	          |		Ссылка,
	          |		НомерСтроки,
	          |		Документ,
	          |		Счет,
	          |		Сумма
	          |	)
	          |ИЗ
	          |	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет";
	приходнасчетпродажи = з.Выполнить().Выгрузить();
	вывод.Вставить("приходнасчетпродажи",приходнасчетпродажи);
	
	з.Текст = "ВЫБРАТЬ
	          |	ПриходОтКредитов.Ссылка,
	          |	ПриходОтКредитов.Номер,
	          |	ПриходОтКредитов.Дата,
	          |	ПриходОтКредитов.Проведен,
	          |	ПриходОтКредитов.Счет,
	          |	ПриходОтКредитов.Сумма,
	          |	ПриходОтКредитов.КредитВБанке
	          |ИЗ
	          |	Документ.ПриходОтКредитов КАК ПриходОтКредитов";
	приходнасчеткредиты = з.Выполнить().Выгрузить();
	вывод.Вставить("приходнасчеткредиты",приходнасчеткредиты);
	
	з.Текст = "ВЫБРАТЬ
	          |	ВложенияВолжска.Ссылка,
	          |	ВложенияВолжска.Код,
	          |	ВложенияВолжска.Наименование,
	          |	ВложенияВолжска.Сумма,
	          |	ВложенияВолжска.СуммаДолга
	          |ИЗ
	          |	Справочник.ВложенияВолжска КАК ВложенияВолжска";
	КредитВБанке = з.Выполнить().Выгрузить();
	вывод.Вставить("КредитВБанке",КредитВБанке);

	з.Текст = "ВЫБРАТЬ
	          |	ПеремещениеМеждуСчетами.Откуда,
	          |	ПеремещениеМеждуСчетами.Куда,
	          |	ПеремещениеМеждуСчетами.Сумма,
	          |	ПеремещениеМеждуСчетами.Ссылка,
	          |	ПеремещениеМеждуСчетами.Номер,
	          |	ПеремещениеМеждуСчетами.Дата,
	          |	ПеремещениеМеждуСчетами.Проведен
	          |ИЗ
	          |	Документ.ПеремещениеМеждуСчетами КАК ПеремещениеМеждуСчетами";
	переводмеждусчетами = з.Выполнить().Выгрузить();
	вывод.Вставить("переводмеждусчетами",переводмеждусчетами);
	Текст = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	//Текст = Новый ЗаписьТекста("D:\cup.json", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info><items>";
	Текст.Записать(JSONm.дт_ЗаписатьJSON(вывод));
	Текст.Закрыть();
КонецПроцедуры
